# CHAPTER 5

# Getting Started with pandas

pandas is often used in tandem with numerical
computing tools like NumPy and SciPy, analytical libraries like statsmodels and
scikit-learn, and data visualization libraries like matplotlib. pandas adopts significant
parts of NumPy’s idiomatic style of array-based computing, especially array-based
functions and a preference for data processing without for loops.

##### While pandas adopts many coding idioms from NumPy, the biggest difference is that pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast, is best suited for working with homogeneous numerical array data.

### Throughout the rest of the book, I use the following import convention for pandas:
##  import pandas as pd

In [1]:
import pandas as pd     #Thus, whenever you see pd. in code, it’s referring to pandas.

#### You may also find it easier to import Series and DataFrame into the local namespace since they are so frequently used:
## In [2]: from pandas import Series, DataFrame

In [2]:
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Structures

#### To get started with pandas, you will need to get comfortable with its two workhorse data structures: Series and DataFrame.

### A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.The simplest Series is formed from only an array of data:

In [3]:
obj = pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

### The string representation of a Series displayed interactively shows the index on the left and the values on the right. Since we did not specify an index for the data, a default one consisting of the integers 0 through N - 1 (where N is the length of the data) is created. You can get the array representation and index object of the Series via its values and index attributes, respectively:

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])        #Often it will be desirable to create a Series with an index identifying each data point with a label:

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

## Compared with NumPy arrays, you can use labels in the index when selecting single values or a set of values:

In [10]:
obj2['a']

-5

In [11]:
obj2['d']

4

In [12]:
obj2[['c', 'a', 'd']]  #Here ['c', 'a', 'd'] is interpreted as a list of indices,
                       # even though it contains strings instead of integers.

c    3
a   -5
d    4
dtype: int64

## Using NumPy functions or NumPy-like operations, such as filtering with a boolean array, scalar multiplication, or applying math functions, will preserve the index-value link:

In [13]:
 obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a map‐
ping of index values to data values. It can be used in many contexts where you might
use a dict:

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

### Should you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = pd.Series(sdata)

In [20]:
obj3         # Series will have the dict’s keys in sorted order.

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
#You can override this by passing the dict keys in the order you
#want them to appear in the resulting Series:

states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)

In [22]:
print(obj4)         #Here, three values found in sdata were placed in the appropriate locations, but since
                    #no value for 'California' was found, it appears as NaN (not a number), which is con‐
                    #sidered in pandas to mark missing or NA values. Since 'Utah' was not included in
                    #states, it is excluded from the resulting object.

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
pd.isnull(obj4)       #The isnull and notnull functions in pandas should be used to detect missing data:

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
obj4.isnull()             #Series also has these as instance methods:

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
print(obj4)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the Series object itself and its index have a name attribute, which integrates with
other key areas of pandas functionality:

In [29]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series’s index can be altered in-place by assignment:

In [30]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [32]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collec‐
tion of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index. Under the hood, the data is stored as one
or more two-dimensional blocks rather than a list, dict, or some other collection of
one-dimensional arrays.

#### There are many ways to construct a DataFrame, though one of the most common is from a dict of equal-length lists or NumPy arrays:

In [33]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [34]:
frame = pd.DataFrame(data)

In [35]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [36]:
frame.head()      #For large DataFrames, the head method selects only the first five rows:

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [37]:
pd.DataFrame(data, columns=['year', 'state', 'pop']) #If you specify a sequence of columns, the DataFrame’s
                                                     #columns will be arranged inthat order:

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [38]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four','five', 'six'])

In [39]:


frame2   #If you pass a column that isn’t contained in the dict, it will appear with missing values in the result:

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [40]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
frame2['state']   #A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [42]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

Attribute-like access (e.g., frame2.year) and tab completion of col‐
umn names in IPython is provided as a convenience.
frame2[column] works for any column name, but frame2.column
only works when the column name is a valid Python variable
name.

### Note that the returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.
### Rows can also be retrieved by position or name with the special loc attribute (much more on this later):

In [43]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment. For example, the empty 'debt' column
could be assigned a scalar value or an array of values:

In [44]:
frame2['debt'] = 16.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [46]:
frame2['debt'] = np.arange(6.)

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

When you are assigning lists or arrays to a column, the value’s length must match the
length of the DataFrame. If you assign a Series, its labels will be realigned exactly to
the DataFrame’s index, inserting missing values in any holes:

In [48]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [49]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [50]:
frame2['debt'] = val

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

Assigning a column that doesn’t exist will create a new column. The del keyword will
delete columns as with a dict.
As an example of del, I first add a new column of boolean values where the state
column equals 'Ohio':

In [52]:
frame2['eastern'] = frame2.state == 'Ohio'   #New columns cannot be created with the frame2.eastern syntax.

In [53]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [54]:
del frame2['eastern']       #The del method can then be used to remove this column:

In [55]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

The column returned from indexing a DataFrame is a view on the
underlying data, not a copy. Thus, any in-place modifications to the
Series will be reflected in the DataFrame. The column can be
explicitly copied with the Series’s copy method.

### Another common form of data is a nested dict of dicts:

In [56]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

#If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys
#as the columns and the inner keys as the row indices:

In [57]:
frame3 = pd.DataFrame(pop)

In [58]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

### You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array:

In [59]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [60]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

### Dicts of Series are treated in much the same way:

In [61]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

In [62]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

If a DataFrame’s index and columns have their name attributes set, these will also be
displayed:

In [63]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [64]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

As with Series, the values attribute returns the data contained in the DataFrame as a
two-dimensional ndarray:

In [65]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [66]:
#If the DataFrame’s columns are different dtypes, the dtype of the values array will be
#chosen to accommodate all of the columns:

frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# Table 5-1. Possible data inputs to DataFrame constructor  Pg#134

## Index Objects

pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels you use when
constructing a Series or DataFrame is internally converted to an Index:

In [67]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [68]:
index = obj.index

In [69]:
index

Index(['a', 'b', 'c'], dtype='object')

In [70]:
index[1:]

Index(['b', 'c'], dtype='object')

### Index objects are immutable and thus can’t be modified by the user:

In [71]:
index[1] = 'd' # TypeError

TypeError: Index does not support mutable operations

In [ ]:
#Immutability makes it safer to share Index objects among data structures:
labels = pd.Index(np.arange(3))

In [ ]:
labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [ ]:
obj2

In [ ]:
obj2.index is labels

Some users will not often take advantage of the capabilities pro‐
vided by indexes, but because some operations will yield results
containing indexed data, it’s important to understand how they
work.

### In addition to being array-like, an Index also behaves like a fixed-size set:

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

### Unlike Python sets, a pandas Index can contain duplicate labels:

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [ ]:
dup_labels

### Selections with duplicate labels will select all occurrences of that label.

Some useful ones are summarized in
Table 5-2.
Table 5-2. Some Index methods and properties

# 5.2 Essential Functionality

This section will walk you through the fundamental mechanics of interacting with the
data contained in a Series or DataFrame.

## Reindexing
An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index. Consider an example:

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [ ]:
obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])   #Calling reindex on this Series rearranges the data according to the new index, 
                                                #introducing missing values if any index values were not already present:
obj2

For ordered data like time series, it may be desirable to do some interpolation or fill‐
ing of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values:

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [ ]:
obj3

In [ ]:
obj3.reindex(range(6), method='ffill')

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result:

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [ ]:
frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [ ]:
frame2

The columns can be reindexed with the columns keyword:

In [ ]:
states = ['Texas', 'Utah', 'California']

In [ ]:
frame.reindex(columns=states)

As we’ll explore in more detail, you can reindex more succinctly by label-indexing
with loc, and many users prefer to use it exclusively:

In [ ]:
frame.loc[['a', 'b', 'c', 'd'], states]

### Table 5-3. reindex function arguments   pg#138

# Dropping Entries from an Axis

Dropping one or more entries from an axis is easy if you already have an index array
or list without those entries. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from
an axis:

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj

In [ ]:
new_obj = obj.drop('c')
new_obj

In [ ]:
obj.drop(['d', 'c'])

With DataFrame, index values can be deleted from either axis. To illustrate this, we
first create an example DataFrame:

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [ ]:
data

Calling drop with a sequence of labels will drop values from the row labels (axis 0):

In [ ]:
data.drop(['Colorado', 'Ohio'])

You can drop values from the columns by passing axis=1 or axis='columns':

In [ ]:
data.drop('two', axis=1)

In [ ]:
data.drop(['two', 'four'], axis='columns')

Many functions, like drop, which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:

In [ ]:
obj.drop('c', inplace=True)          #Be careful with the inplace, as it destroys any data that is dropped

In [ ]:
obj

## Indexing, Selection, and Filtering

Series indexing (obj[...]) works analogously to NumPy array indexing, except you
can use the Series’s index values instead of only integers. Here are some examples of
this:

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

In [ ]:
obj['b']

In [ ]:
obj[1]

In [ ]:
obj[2:4]

In [ ]:
obj[['b', 'a', 'd']]

In [ ]:
obj[[1, 3]]

In [ ]:
obj[obj < 2]

Slicing with labels behaves differently than normal Python slicing in that the end‐
point is inclusive:

In [ ]:
obj['b':'c']

Setting using these methods modifies the corresponding section of the Series:

In [ ]:
obj['b':'c'] = 5

In [ ]:
obj

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data['two']

In [ ]:
data[['three', 'one']]

Indexing like this has a few special cases. First, slicing or selecting data with a boolean
array:

In [ ]:
data[:2]

In [ ]:
data[data['three'] > 5]

The row selection syntax data[:2] is provided as a convenience. Passing a single ele‐
ment or a list to the [] operator selects columns

Another use case is in indexing with a boolean DataFrame, such as one produced by a
scalar comparison:

In [ ]:
data < 5

In [ ]:
data[data < 5] = 0
data

This makes DataFrame syntactically more like a two-dimensional NumPy array in
this particular case.

## Selection with loc and iloc

For DataFrame label-indexing on the rows, I introduce the special indexing operators
loc and iloc. They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (loc) or integers
(iloc).

As a preliminary example, let’s select a single row and multiple columns by label:

In [ ]:
data.loc['Colorado', ['two', 'three']]

We’ll then perform some similar selections with integers using iloc:

In [ ]:
data.iloc[2, [3, 0, 1]]

In [ ]:
data.iloc[2]

In [ ]:
data.iloc[[1, 2], [3, 0, 1]]

In [ ]:
#Both indexing functions work with slices in addition to single labels or lists of labels:
data.loc[:'Utah', 'two']

In [ ]:
data.iloc[:, :3][data.three > 5]

So there are many ways to select and rearrange the data contained in a pandas object.
For DataFrame, Table 5-4 provides a short summary of many of them. As you’ll see
later, there are a number of additional options for working with hierarchical indexes.

When originally designing pandas, I felt that having to type
frame[:, col] to select a column was too verbose (and errorprone), since column selection is one of the most common opera‐
tions. I made the design trade-off to push all of the fancy indexing
behavior (both labels and integers) into the ix operator. In practice,
this led to many edge cases in data with integer axis labels, so the
pandas team decided to create the loc and iloc operators to deal
with strictly label-based and integer-based indexing, respectively.
The ix indexing operator still exists, but it is deprecated. I do not
recommend using it.
Table 5-4. Indexing options with DataFrame    pg#144

## Integer Indexes

Working with pandas objects indexed by integers is something that often trips up
new users due to some differences with indexing semantics on built-in Python data
structures like lists and tuples. For example, you might not expect the following code
to generate an error:

In [76]:
ser=pd.Series(np.arange(3.))

In [77]:
ser[-1]

KeyError: -1

In this case, pandas could “fall back” on integer indexing, but it’s difficult to do this in
general without introducing subtle bugs. Here we have an index containing 0, 1, 2,
but inferring what the user wants (label-based indexing or position-based) is difficult:

In [78]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [79]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c']) #On the other hand, with a non-integer index,
                                                       #there is no potential for ambiguity

In [80]:
ser2[-1]

2.0

To keep things consistent, if you have an axis index containing integers, data selection
will always be label-oriented. For more precise handling, use loc (for labels) or iloc
(for integers):

In [81]:
ser[:1]

0    0.0
dtype: float64

In [82]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [83]:
ser.iloc[:1]

0    0.0
dtype: float64

## Arithmetic and Data Alignment

An important pandas feature for some applications is the behavior of arithmetic
between objects with different indexes. When you are adding together objects, if any
index pairs are not the same, the respective index in the result will be the union of the
index pairs. For users with database experience, this is similar to an automatic outer
join on the index labels. Let’s look at an example:

In [84]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [85]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [86]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [88]:
s1+s2  #Adding these together yields:

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that don’t
overlap. Missing values will then propagate in further arithmetic computations.
In the case of DataFrame, alignment is performed on both the rows and the columns:

In [89]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [90]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [91]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [92]:
df1 + df2   #Adding these together returns a DataFrame whose index and columns are the unions
            #of the ones in each DataFrame:

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear
as all missing in the result. The same holds for the rows whose labels are not common
to both objects.
If you add DataFrame objects with no column or row labels in common, the result
will contain all nulls:

In [93]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [94]:
df1

   A
0  1
1  2

In [95]:
df2

   B
0  3
1  4

In [96]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

# Arithmetic methods with fill values


In arithmetic operations between differently indexed objects, you might want to fill
with a special value, like 0, when an axis label is found in one object but not the other:

In [97]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

In [98]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [99]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [100]:
df1 + df2  #Adding these together results in NA values in the locations that don’t overlap:

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1, I pass df2 and an argument to fill_value:

In [103]:
df1.add(df2, fill_value=0)    #Using the add method on df1, I pass df2 and an argument to fill_value:

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

See Table 5-5 for a listing of Series and DataFrame methods for arithmetic. Each of
them has a counterpart, starting with the letter r, that has arguments flipped. So these
two statements are equivalent:

In [104]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [105]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill
value:

In [106]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

Table 5-5. Flexible arithmetic methods    pg#149

## Operations between DataFrame and Series

As with NumPy arrays of different dimensions, arithmetic between DataFrame and
Series is also defined. First, as a motivating example, consider the difference between
a two-dimensional array and one of its rows:

In [107]:
arr = np.arange(12.).reshape((3, 4))

In [108]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [109]:
arr[0]

array([0., 1., 2., 3.])

In [112]:
arr - arr[0]        #When we subtract arr[0] from arr, the subtraction is performed once for each row.
                    #This is referred to as broadcasting and is explained in more detail as it relates to gen‐
                    #eral NumPy arrays in Appendix A. Operations between a DataFrame and a Series are similar:

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [113]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [114]:
series = frame.iloc[0]

In [115]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [116]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [118]:
frame - series     #By default, arithmetic between DataFrame and Series matches the index of the Series
                   #on the DataFrame’s columns, broadcasting down the rows:

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [120]:
#If an index value is not found in either the DataFrame’s columns or the Series’s index,
#the objects will be reindexed to form the union:


series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [121]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods. For example:

In [125]:
series3 = frame['d']

In [126]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [127]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

The axis number that you pass is the axis to match on. In this case we mean to match
on the DataFrame’s row index (axis='index' or axis=0) and broadcast across.

## Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [128]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [129]:
frame

               b         d         e
Utah   -0.352221  0.960824  2.320547
Ohio    1.744421  0.211608  0.877676
Texas   0.022383 -0.473931  0.203751
Oregon -0.289805 -1.215171  0.342083

In [130]:
np.abs(frame)

               b         d         e
Utah    0.352221  0.960824  2.320547
Ohio    1.744421  0.211608  0.877676
Texas   0.022383  0.473931  0.203751
Oregon  0.289805  1.215171  0.342083

Another frequent operation is applying a function on one-dimensional arrays to each
column or row. DataFrame’s apply method does exactly this:

In [133]:
f = lambda x: x.max() - x.min()    #Here the function f, which computes the difference between the maximum and mini‐
                                   #mum of a Series, is invoked once on each column in frame. The result is a Series having
                                #the columns of frame as its index.

In [134]:
frame.apply(f)

b    2.096642
d    2.175995
e    2.116796
dtype: float64

If you pass axis='columns' to apply, the function will be invoked once per row
instead:

In [135]:
frame.apply(f, axis='columns')

Utah      2.672768
Ohio      1.532813
Texas     0.677682
Oregon    1.557254
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame meth‐
ods, so using apply is not necessary.

The function passed to apply need not return a scalar value; it can also return a Series
with multiple values:

In [141]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [142]:
frame.apply(f)

            b         d         e
min -0.352221 -1.215171  0.203751
max  1.744421  0.960824  2.320547

Element-wise Python functions can be used, too. Suppose you wanted to compute a
formatted string from each floating-point value in frame. You can do this with apply
map:

In [143]:
format = lambda x: '%.2f' % x

In [144]:
 frame.applymap(format)

            b      d     e
Utah    -0.35   0.96  2.32
Ohio     1.74   0.21  0.88
Texas    0.02  -0.47  0.20
Oregon  -0.29  -1.22  0.34

In [145]:
#The reason for the name applymap is that Series has a map method for applying an element-wise function:
frame['e'].map(format)

Utah      2.32
Ohio      0.88
Texas     0.20
Oregon    0.34
Name: e, dtype: object

## Sorting and Ranking

Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object:

In [146]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [147]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [149]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [150]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [151]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default, but can be sorted in descending
order, too:

In [152]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [154]:
obj = pd.Series([4, 7, -3, 2])

In [155]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [156]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [157]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort
keys. To do so, pass one or more column names to the by option of sort_values:

In [158]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [159]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [160]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [162]:
#To sort by multiple columns, pass a list of names:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [163]:
#Ranking assigns ranks from one through the number of valid data points in an array.
#The rank methods for Series and DataFrame are the place to look; by default rank
#breaks ties by assigning each group the mean rank:

obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [165]:
#Ranks can also be assigned according to the order in which they’re observed in the data:

obj.rank(method='first')   #Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have
                           #been set to 6 and 7 because label 0 precedes label 2 in the data.
                           #You can rank in descending order, too:

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [166]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

See Table 5-6 for a list of tie-breaking methods available.
DataFrame can compute ranks over the rows or the columns:

In [167]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})

In [168]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [169]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Table 5-6. Tie-breaking methods with rank   pg#156

### Axis Indexes with Duplicate Labels

Up until now all of the examples we’ve looked at have had unique axis labels (index
values). While many pandas functions (like reindex) require that the labels be
unique, it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [170]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [171]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [172]:
#The index’s is_unique property can tell you whether its labels are unique or not:
obj.index.is_unique

False

In [173]:
#Data selection is one of the main things that behaves differently with duplicates.
#Indexing a label with multiple entries returns a Series, while single entries return a scalar value:
obj['a']

a    0
a    1
dtype: int64

In [174]:
obj['c']

4

This can make your code more complicated, as the output type from indexing can
vary based on whether a label is repeated or not.
The same logic extends to indexing rows in a DataFrame:

In [175]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.782316  0.133162  0.264720
a  0.066685 -1.247950 -1.162813
b -0.452066 -0.483776 -1.307095
b -0.071107 -1.275004 -0.076131

In [176]:
df.loc['b']

          0         1         2
b -0.452066 -0.483776 -1.307095
b -0.071107 -1.275004 -0.076131

# 5.3 Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical meth‐
ods. Most of these fall into the category of reductions or summary statistics, methods
that extract a single value (like the sum or mean) from a Series or a Series of values
from the rows or columns of a DataFrame. Compared with the similar methods
found on NumPy arrays, they have built-in handling for missing data. Consider a
small DataFrame:

In [177]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [178]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [181]:
#Calling DataFrame’s sum method returns a Series containing column sums:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [182]:
#Passing axis='columns' or axis=1 sums across the columns instead:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [183]:
#NA values are excluded unless the entire slice (row or column in this case) is NA.
#This can be disabled with the skipna option:

In [184]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

### See Table 5-7 for a list of common options for each reduction method.
### Table 5-7. Options for reduction methods          pg#159

In [185]:
#Some methods, like idxmin and idxmax, return indirect statistics like the index value
#where the minimum or maximum values are attained:
df.idxmax()

one    b
two    d
dtype: object

In [186]:
#Other methods are accumulations:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [187]:
#Another type of method is neither a reduction nor an accumulation. describe is one
#such example, producing multiple summary statistics in one shot:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [188]:
#On non-numeric data, describe produces alternative summary statistics:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### See Table 5-8 for a full list of summary statistics and related methods.
### Table 5-8. Descriptive and summary statistics

## Correlation and Covariance

Let’s consider some DataFrames of stock prices and volumes obtained
from Yahoo! Finance using the add-on pandas-datareader package.

In [190]:
#If you don’t have it installed already, it can be obtained via conda or pip:
#conda install pandas-datareader
#I use the pandas_datareader module to download some data for a few stock tickers:

In [192]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
 for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [195]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [196]:
#It’s possible by the time you are reading this that Yahoo! Finance no
#longer exists since Yahoo! was acquired by Verizon in 2017. Refer
#to the pandas-datareader documentation online for the latest functionality.

In [199]:
returns = price.pct_change()

In [200]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-07-08 -0.020614 -0.005729 -0.000730 -0.013468
2019-07-09  0.006099 -0.008821 -0.003651  0.007596
2019-07-10  0.009889  0.008182  0.010186  0.013913
2019-07-11 -0.007282  0.005482  0.003990  0.003271
2019-07-12  0.007683  0.010620  0.003613  0.000603

In [202]:
#The corr method of Series computes the correlation of the overlapping, non-NA,
#aligned-by-index values in two Series. Relatedly, cov computes the covariance:
returns['MSFT'].corr(returns['IBM'])

0.48744820083871365

In [203]:
returns['MSFT'].cov(returns['IBM'])

8.654884213655072e-05

In [204]:
#Since MSFT is a valid Python attribute, we can also select these columns using more concise syntax:
returns.MSFT.corr(returns.IBM)

0.48744820083871365

In [205]:
#DataFrame’s corr and cov methods, on the other hand, return a full correlation or covariance matrix as a DataFrame, respectively:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.379762  0.453162  0.461068
IBM   0.379762  1.000000  0.487448  0.403278
MSFT  0.453162  0.487448  1.000000  0.537976
GOOG  0.461068  0.403278  0.537976  1.000000

In [206]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000266  0.000076  0.000107  0.000116
IBM   0.000076  0.000151  0.000087  0.000077
MSFT  0.000107  0.000087  0.000209  0.000120
GOOG  0.000116  0.000077  0.000120  0.000238

In [207]:
#Using DataFrame’s corrwith method, you can compute pairwise correlations
#between a DataFrame’s columns or rows with another Series or DataFrame. Passing a
#Series returns a Series with the correlation value computed for each column:
returns.corrwith(returns.IBM)

AAPL    0.379762
IBM     1.000000
MSFT    0.487448
GOOG    0.403278
dtype: float64

In [208]:
#Passing a DataFrame computes the correlations of matching column names. Here I
#compute correlations of percent changes with volume:

returns.corrwith(volume)

AAPL   -0.062484
IBM    -0.156547
MSFT   -0.090644
GOOG   -0.021413
dtype: float64

# Unique Values, Value Counts, and Membership

In [209]:
#Another class of related methods extracts information about the values contained in a
#one-dimensional Series. To illustrate these, consider this example:

obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [210]:
#The first function is unique, which gives you an array of the unique values in a Series:
uniques = obj.unique()

In [211]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in sorted order, but could be sorted
after the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series
containing value frequencies:

In [212]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [214]:
#pandas method that can be used with any array or sequence:
pd.value_counts(obj.values, sort=False)

c    3
b    2
d    1
a    3
dtype: int64

In [215]:
#isin performs a vectorized set membership check and can be useful in filtering a
#dataset down to a subset of values in a Series or column in a DataFrame:

In [217]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [218]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [219]:
#Related to isin is the Index.get_indexer method, which gives you an index array
#from an array of possibly non-distinct values into another array of distinct values:

In [220]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

### See Table 5-9 for a reference on these methods.
### Table 5-9. Unique, value counts, and set membership methods   pg#164

In [222]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3], 'Qu3': [1, 5, 2, 4, 4]})

In [223]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [224]:
#Passing pandas.value_counts to this DataFrame’s apply function gives:
result = data.apply(pd.value_counts).fillna(0)

In [226]:
result      #Here, the row labels in the result are the distinct values occurring in all of the columns.
            #The values are the respective counts of these values in each column.

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# 5.4 Conclusion

###  In the next chapter, we’ll discuss tools for reading (or loading) and writing datasets with pandas. After that, we’ll dig deeper into data cleaning, wrangling, analysis, and visualization tools using pandas.